РемонтПК_Конфигурация/src/Documents/АктВыполненныхРабот/АктВыполненныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВыполненныхРабот</name>
  <registerRecords>AccumulationRegister.ЗагруженностьСпециалистов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗапчастей</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ТоварыНаСкладе</types>
        <types>CatalogRef.КаталогУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РемонтПК_Конфигурация/src/AccumulationRegisters/ЗагруженностьСпециалистов/ЗагруженностьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗагруженностьСпециалистов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Специалисты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РемонтПК_Конфигурация/src/AccumulationRegisters/ОстаткиЗапчастей/ОстаткиЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗапчастей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.ТоварыНаСкладе</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РемонтПК_Конфигурация/src/Documents/АктВыполненныхРабот/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
		
	// Получаем специалиста
	СпециалистДляРегистра = Специалист;
	Если НЕ ЗначениеЗаполнено(СпециалистДляРегистра) 
		И ЗначениеЗаполнено(Заявка) Тогда
		СпециалистДляРегистра = Заявка.Специалист;
	КонецЕсли;
		
	// Движения по регистру ЗагруженностьСпециалистов
	Движения.ЗагруженностьСпециалистов.Записывать = Истина;
	Движение = Движения.ЗагруженностьСпециалистов.Добавить();
	Движение.Период          = Дата;
	Движение.Специалист      = СпециалистДляРегистра;
	Движение.Заявка          = Заявка;
	Движение.КоличествоРабот = 1;
	
	// Движения по регистру ОстаткиЗапчастей
	Движения.ОстаткиЗапчастей.Записывать = Истина;
	
	Для Каждого Строка Из Работы Цикл
		Если ТипЗнч(Строка.Номенклатура) = 
				Тип("СправочникСсылка.ТоварыНаСкладе") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ОстаткиЗапчастейОстатки.КоличествоОстаток КАК Остаток
				|ИЗ
				|	РегистрНакопления.ОстаткиЗапчастей.Остатки(
				|		&Период,
				|		Запчасть = &Запчасть) КАК ОстаткиЗапчастейОстатки";
			
			Запрос.УстановитьПараметр("Период",   Дата);
			Запрос.УстановитьПараметр("Запчасть", Строка.Номенклатура);
			
			Результат = Запрос.Выполнить().Выбрать();
			ТекущийОстаток = 0;
			Если Результат.Следующий() Тогда
				ТекущийОстаток = Результат.Остаток;
			КонецЕсли;
			
			Если ТекущийОстаток < Строка.Количество Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Недостаточно запчасти: " 
					+ Строка.Номенклатура 
					+ ". Есть: " + ТекущийОстаток 
					+ ", нужно: " + Строка.Количество;
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
			Движение = Движения.ОстаткиЗапчастей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = Дата;
			Движение.Запчасть    = Строка.Номенклатура;
			Движение.Количество  = Строка.Количество;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
